tap "evanpurkhiser/personal"

cask "google-chrome"
cask "1password"
cask "hammerspoon"
cask "karabiner-elements"
cask "slack"
cask "alacritty"
cask "colorsnapper"
cask "pixelsnap"
cask "notion"
cask "numi"
cask "figma"
cask "telegram"

# Basic terminal stuff
brew "bash"
brew "bash-completion"
brew "coreutils"
brew "font-caskaydia-cove-nerd-font"

# Terminal window managment
brew "tmux"
brew "reattach-to-user-namespace"

# Tooling
brew "entr"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "htop"
brew "imagemagick"
brew "jq"
brew "neovim"
brew "ripgrep"
brew "rsync"
brew "shfmt"
brew "tree"
brew "unrar"
brew "wget"


# Languages, runtimes, compilers
brew "cmake"
brew "go"
brew "node"
brew "python"
brew "ruby"
brew "sqlite"

# Dependency managment
brew "pyenv"
brew "volta"
brew "direnv"

# Adjust key repeat rate
brew "koekeishiya/formulae/krp"
