tap "evanpurkhiser/personal"

cask "google-chrome"
cask "1password"
cask "goofy"
cask "hammerspoon"
cask "karabiner-elements"
cask "slack"
cask "vlc"
cask "kap"

brew "bash"
brew "bash-completion"
brew "coreutils"
brew "dep"
brew "entr"
brew "ffmpeg"
brew "fzf"
brew "git"
brew "go"
brew "htop"
brew "imagemagick"
brew "jq"
brew "node"
brew "python"
brew "python3"
brew "reattach-to-user-namespace"
brew "ripgrep"
brew "rsync"
brew "ruby"
brew "sqlite"
brew "tmux"
brew "tree"
brew "unrar"
brew "vim"
brew "wget"
brew "yarn"
brew "cmake"
