tap "evanpurkhiser/personal"
tap "homebrew/cask-fonts"
tap "1password/tap"

cask "1password"
cask "alacritty"
cask "cron"
cask "discord"
cask "figma"
cask "google-chrome"
cask "hammerspoon"
cask "karabiner-elements"
cask "notion"
cask "numi"
cask "pixelsnap"
cask "raycast"
cask "slack"
cask "tailscale"
cask "telegram"
cask "font-caskaydia-cove-nerd-font"
cask "1password-cli"

# Basic terminal stuff
brew "bash"
brew "bash-completion"
brew "coreutils"

# Used to allow sudo via touch ID in tmux
#
# $ head -2 /etc/pam.d/sudo
# auth  optional    /opt/homebrew/lib/pam/pam_reattach.so
# auth  sufficient  pam_tid.so
brew "pam-reattach"

# Terminal window managment
brew "tmux"

# Tooling
brew "entr"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "htop"
brew "imagemagick"
brew "jq"
brew "lsd"
brew "neovim"
brew "ripgrep"
brew "rsync"
brew "shfmt"
brew "stylua"
brew "tree"
brew "wget"

# Languages, runtimes, compilers
brew "cmake"
brew "go"
brew "node"
brew "python"
brew "ruby"
brew "sqlite"

# Dependency managment
brew "pyenv"
brew "volta"
brew "direnv"
brew "yarn"
