tap "evanpurkhiser/personal"
tap "homebrew/autoupdate"

cask "1password"
cask "1password-cli"
cask "alacritty"
cask "arc"
cask "chatgpt"
cask "discord"
cask "displaperture"
cask "figma"
cask "jurplel/tap/instant-space-switcher"
cask "font-caskaydia-cove-nerd-font"
cask "google-chrome"
cask "hammerspoon"
cask "karabiner-elements"
cask "lookaway"
cask "notion"
cask "numi"
cask "obsidian"
cask "pixelsnap"
cask "raycast"
cask "slack"
cask "tailscale-app"
cask "telegram"

# Basic terminal stuff
brew "atuin"
brew "bash"
brew "bash-completion@2"
brew "coreutils"
brew "vivid"

# Used to allow sudo via touch ID in tmux. Will be automatically configured by
# platform-osx/bash/functions.d/sudo
brew "pam-reattach"

# Terminal window management
brew "tmux"
brew "tmux-ai-titles"

# Tooling
brew "codespell"
brew "entr"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "htop"
brew "imagemagick"
brew "jq"
brew "jsonlint"
brew "jsonnet"
brew "lsd"
brew "neovim"
brew "oxfmt"
brew "ripgrep"
brew "rsync"
brew "ruff"
brew "shellcheck"
brew "shfmt"
brew "stylua"
brew "taplo"
brew "things3-cloud"
brew "tree"
brew "tree-sitter-cli"
brew "typos-cli"
brew "wget"

# Languages, runtimes, compilers
brew "cmake"
brew "go"
brew "node"
brew "python"
brew "ruby"
brew "sqlite"

# Dependency management
brew "direnv"
brew "pyenv"
brew "volta"
brew "yarn"
